load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'

scenarios:
  - name: "Public Pages"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/prijava"
      - think: 1
      - get:
          url: "/registracija"
      - think: 2
      - get:
          url: "/api/health"

  - name: "API Health Check"
    flow:
      - get:
          url: "/api/health"